sterentev/atdf-device-asm-include/inc/ATtiny167.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	LINDAT		= 0xD2		; [MEMORY MAPPED] LIN Data Register
.equ	LINSEL		= 0xD1		; [MEMORY MAPPED] LIN Data Buffer Selection Register
.equ	LINIDR		= 0xD0		; [MEMORY MAPPED] LIN Identifier Register
.equ	LINDLR		= 0xCF		; [MEMORY MAPPED] LIN Data Length Register
.equ	LINBRRH		= 0xCE		; [MEMORY MAPPED] LIN Baud Rate High Register
.equ	LINBRRL		= 0xCD		; [MEMORY MAPPED] LIN Baud Rate Low Register
.equ	LINBTR		= 0xCC		; [MEMORY MAPPED] LIN Bit Timing Register
.equ	LINERR		= 0xCB		; [MEMORY MAPPED] LIN Error Register
.equ	LINENIR		= 0xCA		; [MEMORY MAPPED] LIN Enable Interrupt Register
.equ	LINSIR		= 0xC9		; [MEMORY MAPPED] LIN Status and Interrupt Register
.equ	LINCR		= 0xC8		; [MEMORY MAPPED] LIN Control Register
.equ	USIPP		= 0xBC		; [MEMORY MAPPED] USI Pin Position
.equ	USIBR		= 0xBB		; [MEMORY MAPPED] USI Buffer Register
.equ	USIDR		= 0xBA		; [MEMORY MAPPED] USI Data Register
.equ	USISR		= 0xB9		; [MEMORY MAPPED] USI Status Register
.equ	USICR		= 0xB8		; [MEMORY MAPPED] USI Control Register
.equ	ASSR		= 0xB6		; [MEMORY MAPPED] Asynchronous Status Register
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register A  Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer/Counter1  Bytes
.equ	TCCR1D		= 0x83		; [MEMORY MAPPED] Timer/Counter1 Control Register D
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] The ADC Control and Status register B (Shared with ANALOG_COMPARATOR IO_MODULE)
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register A
.equ	ADC		= 0x78		; [MEMORY MAPPED] ADC Data Register  Bytes
.equ	AMISCR		= 0x77		; [MEMORY MAPPED] Analog Miscellaneous Control Register (Shared with CURRENT_SOURCE IO_MODULE)
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter1 Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask register
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Register
.equ	PRR		= 0x64		; [MEMORY MAPPED] Power Reduction Register
.equ	CLKSELR		= 0x63		; [MEMORY MAPPED] Clock Selection Register
.equ	CLKCSR		= 0x62		; [MEMORY MAPPED] Clock Control & Status Register
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer  Bytes
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	DWDR		= 0x31		; DebugWire data register
.equ	ACSR		= 0x30		; Analog Comparator Control And Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO register 2
.equ	GPIOR1		= 0x2A		; General Purpose register 1
.equ	OCR0A		= 0x28		; Timer/Counter0 Output Compare Register A
.equ	TCNT0		= 0x27		; Timer/Counter0
.equ	TCCR0B		= 0x26		; Timer/Counter0 Control Register B
.equ	TCCR0A		= 0x25		; Timer/Counter0 Control Register A
.equ	GTCCR		= 0x23		; General Timer Counter Control register
.equ	EEAR		= 0x21		; EEPROM Address Register  Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General purpose register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter1 Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag Register
.equ	PORTCR		= 0x12		; Port Control Register
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	LINUART MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LINCR bits		------------------------
.equ	LSWRES		= 7		; 0x80 - Software Reset
.equ	LIN13		= 6		; 0x40 - LIN Standard
.equ	LCONF_MASK	= 0x30		;      - LIN Configuration bits (2 bits)
.equ	LCONF0		= 4		;          LCONF BIT0 position
.equ	LENA		= 3		; 0x08 - LIN or UART Enable
.equ	LCMD_MASK	= 0x07		;      - LIN Command and Mode bits (3 bits)
.equ	LCMD0		= 0		;          LCMD BIT0 position

